In [7]:
import pandas as pd
import numpy as np
data = {
    'Visitor_ID': [f'V{1000 + i}' for i in range(20)],
    'Name': ['ABHISHEK SANDEEP      ZADE     ', 'ARNAV AJAY DESHPANDE.. ', '.. .. ASHWINI LALCHAND MUNDAWARE/ ', 'GAYATRI SURESH GAIKWAD', 'HARSHADA GANESH CHAUDHARI',
             'VAIBHAVI HARISHWAR PATIL', np.nan, 'VISHAKHA PUNDLIK JADHAV', 'YASH BHARAT SOLUNKE/', 'VIVEK SANTOSH KHANDWE',
             'VISHAKHA PUNDLIK JADHAV', 'Tanushree chhanwal', 'Shruti jaiswal', 'Shriyash Sulakhe', 'YASH BHARAT SOLUNKE',
             np.nan, 'ARNAV AJAY DESHPANDE', 'RUTUJA SANTOSH THOTE', 'ROHIT DILIP BILWAL', 'RITESH SHIVAJI BAIRAGI'],
    'Age': [25, 23, 22, np.nan, 21, 25, 24, 24, 28, np.nan,
            22, 23, 25, 27, 25, 30, 31, 26, 19, 19],
    'Ticket_Price': [500, 750, 500, 1000, np.nan, 500, 700, 650, 750, 1000,
                      500, 800, np.nan, 750, 500, 700, 900, 850, 750, np.nan],
    'Check_In_Time': ['10:00 AM', '10:30 AM', '11:00 AM', '11:30 AM', np.nan,
                       '10:00 AM', '12:00 PM', '12:30 PM', '01:00 PM', '01:30 PM',
                       '11:00 AM', '02:00 PM', np.nan, '02:30 PM', '10:00 AM',
                       '12:00 PM', '03:00 PM', '03:30 PM', '04:00 PM', np.nan],
    'City':['Delhi','Aurangabad', 'Mumbai','Bombay','New Delhi','NDL','Chennai','Chenai','Chennaai','Bangalore',
            'Delhi','Pune', 'New Delhi','Bombay','New Delhi','NDL','Indore','Bangalore','Ujjain','Bangalore'],
    'State': ['Delhi','Maharastra', 'Maharastra','Maharastra','Delhi','Delhi','Tamilnadu','Tamilnadu','Tamilnadu','Karnataka',
            'Delhi','Maharastra', 'Delhi','Maharastra','Delhi','Delhi','Madhya Pradesh','Karnataka','Madhya Pradesh','Karnataka']
}

In [9]:
df = pd.DataFrame(data)
df.head(1)

,Visitor_ID,Name,Age,Ticket_Price,Check_In_Time,City,State
0,V1000,ABHISHEK SANDEEP ZADE,25.0,500.0,10:00 AM,Delhi,Delhi

In [11]:
df.head()

,Visitor_ID,Name,Age,Ticket_Price,Check_In_Time,City,State
0,V1000,ABHISHEK SANDEEP ZADE,25.0,500.0,10:00 AM,Delhi,Delhi
1,V1001,ARNAV AJAY DESHPANDE..,23.0,750.0,10:30 AM,Aurangabad,Maharastra
2,V1002,.. .. ASHWINI LALCHAND MUNDAWARE/,22.0,500.0,11:00 AM,Mumbai,Maharastra
3,V1003,GAYATRI SURESH GAIKWAD,NaN,1000.0,11:30 AM,Bombay,Maharastra
4,V1004,HARSHADA GANESH CHAUDHARI,21.0,NaN,NaN,New Delhi,Delhi

In [13]:
df.describe()

             Age  Ticket_Price
count  18.000000     17.000000
mean   24.388889    711.764706
std     3.292396    170.045409
min    19.000000    500.000000
25%    22.250000    500.000000
50%    24.500000    750.000000
75%    25.750000    800.000000
max    31.000000   1000.000000

In [15]:
df.shape

(20, 7)

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Visitor_ID     20 non-null     object
 1   Name           18 non-null     object
 2   Age            18 non-null     float64
 3   Ticket_Price   17 non-null     float64
 4   Check_In_Time  17 non-null     object
 5   City           20 non-null     object
 6   State          20 non-null     object
dtypes: float64(2), object(5)
memory usage: 1.2+ KB